senserf/picos/PicOS/CC13XX/rfprop.c
#define	DR_LOOP		0
#define	DR_XMIT		1
#define	DR_GOOF		2

#ifdef	DETECT_HANGUPS
static	int txcounter;
#endif

thread (cc1350_driver)

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
	address ppm;
	word pcav;
#endif

	entry (DR_LOOP)

DR_LOOP__:
		if (dstate & DSTATE_IRST) {
			// Reset request
			rf_off ();
			// Need some delay?
			_BIC (dstate,
			 DSTATE_RXAC | DSTATE_RFON | DSTATE_TXIP | DSTATE_IRST);
		}

		// Keep RX state in sync with the requested state
		if (dstate & DSTATE_RXAC) {
			if ((dstate & DSTATE_RXON) == 0)
				rx_de ();
		} else if (dstate & DSTATE_RXON) {
			// Request to activate the receiver
			rf_on ();
			rx_ac ();
		}

		// Try to get a packet to transmit
		if (paylen == 0) {
			if ((RF_cmdPropTx.pPkt = (byte*)tcvphy_get (physid,
			    &paylen)) != NULL) {

				// Ignore the two extra bytes right away, we
				// have no use for them
				paylen -= 2;
				sysassert (paylen <= rbuffl && paylen > 0 &&
				    (paylen & 1) == 0, "cc13 py");

				LEDI (1, 1);

				if (statid != 0xffff)
					// Insert NetId
					((address)(RF_cmdPropTx.pPkt)) [0] =
						statid;

				RF_cmdPropTx.pktLen = (byte) paylen;
			}
		}

		if (paylen == 0) {
			// Nothing to transmit
			wait (qevent, DR_LOOP);
			if (dstate & DSTATE_RXAC) {
				// Try to receive
				rx_int_enable ();
				// For lost interrups (test)
				// delay (1024, DR_LOOP);
			} else if (dstate & DSTATE_RFON) {
				// Delay until off
				delay (offdelay, DR_GOOF);
			}
			release;
		}

		if (bckf_timer) {
			// Backoff wait
#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
Bkf:
#endif
			wait (qevent, DR_LOOP);
			delay (bckf_timer, DR_LOOP);
			if (dstate & DSTATE_RXAC)
				rx_int_enable ();
			release;
		}

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		// Check for CAV requested in the packet
		ppm = (address)(RF_cmdPropTx.pPkt + paylen);
		if ((pcav = (*ppm) & 0x0fff)) {
			// Remove for next turn
			*ppm &= ~0x0fff;
			utimer_set (bckf_timer, pcav);
			goto Bkf;
		}
#endif
		// Make sure we are up and in the right state
		rf_on ();
		rx_de ();

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		if ((pcav = patable [(*ppm >> 12) & 0x7]) !=
		    RF_cmdPropRadioDivSetup.txPower) {
			// Need to change
		    	RF_cmdPropRadioDivSetup.txPower = 
				cmd_sp.txPower = pcav;
			issue_cmd ((lword)&cmd_sp);
		}
#endif

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		((address)(RF_cmdPropTx.pPkt)) [1] = bckf_lbt;
		// Do not zero the counter as it may still grow
#endif

#if RADIO_LBT_SENSE_TIME > 0

		// ============================================================
		// LBT ON =====================================================
		// ============================================================

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		if (*ppm & 0x8000) {
			// LBT off requested by packet
			txtries = RADIO_LBT_MAX_TRIES;
			goto Force;
		}
#endif
		RF_cmdPropTx . status = 0;
		HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) = 
			~RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE;
		issue_cmd ((lword)&cmd_cs);

	entry (DR_XMIT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		if ((HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) &
		    RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE) == 0) {
			// Keep waiting
			delay (1, DR_XMIT);
			release;
		}

		// Check the TX status
		if (RF_cmdPropTx.status != PROP_DONE_OK) {
			if (txtries >= RADIO_LBT_MAX_TRIES) {
#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
Force:
#endif
				// diag ("FORCED");
				RF_cmdPropTx . status = 0;
				HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) = 
					~RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE;
				issue_cmd ((lword)&RF_cmdPropTx);
				proceed (DR_XMIT);
			}
#if RADIO_LBT_MAX_TRIES < 255
			txtries++;
#endif
			// Backoff
			// diag ("BUSY");
#if RADIO_LBT_BACKOFF_EXP == 0
			delay (1, DR_LOOP);
			update_bckf_lbt (1);
			release;
#else
			gbackoff (RADIO_LBT_BACKOFF_EXP);
			update_bckf_lbt (bckf_timer);
			goto DR_LOOP__;
#endif
		}
#else	/* RADIO_LBT_SENSE_TIME */

		// ============================================================
		// LBT OFF ====================================================
		// ============================================================

		RF_cmdPropTx . status = 0;
		HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) = 
			~RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE;
		issue_cmd ((lword)&RF_cmdPropTx);

#ifdef	DETECT_HANGUPS
		txcounter = DETECT_HANGUPS;
#endif
	entry (DR_XMIT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		if ((HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) &
		    RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE) == 0) {
#ifdef	DETECT_HANGUPS
			if (txcounter-- == 0) {
				diag ("TX HANG: %lx", RF_cmdPropTx.status);
				syserror (EHARDWARE, "txhung");
			}
#endif
			delay (1, DR_XMIT);
			release;
		}

		if (RF_cmdPropTx.status != PROP_DONE_OK) {
			// Something went wrong; actually, this can happen
			// when transmitting immediately after rf_on
#ifdef	DETECT_HANGUPS
			// diag ("TX ERR: %lx", RF_cmdPropTx.status);
			// syserror (EHARDWARE, "txerr");
#endif
			delay (1, DR_LOOP);
			release;
		}

#endif	/* RADIO_LBT_SENSE_TIME */

		// ============================================================
		// ============================================================
		// ============================================================

		// Release the packet
		tcvphy_end ((address)(RF_cmdPropTx.pPkt));
		paylen = 0;

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		bckf_lbt = 0;
#endif

#if RADIO_LBT_SENSE_TIME > 0
		txtries = 0;
#endif
		LEDI (1, 0);

#if RADIO_LBT_XMIT_SPACE
		utimer_set (bckf_timer, RADIO_LBT_XMIT_SPACE);
		// If we don't care to space (don't we?), then perhaps we
		// should send whatever pending packets we have in the queue
		// without restarting the receiver
#endif
		// This will restart RX, if RX is logically on
		goto DR_LOOP__;

	entry (DR_GOOF)

		// Inactivity timeout with RX OFF
		if (!(dstate & DSTATE_IRST) && (dstate & DSTATE_RXON) == 0 &&
		    tcvphy_top (physid) == NULL)
			rf_off ();

		goto DR_LOOP__;
endthread

#undef	DR_LOOP
#undef	DR_XMIT
#undef	DR_GOOF

// ============================================================================

static void init_rbuffs () {
//
// Set up the receive buffer pool
//
	int i;
	rfc_dataEntryGeneral_t *re, *da, *db;

	i = 0;
	while (1) {
		db = (rfc_dataEntryGeneral_t*)
			umalloc (sizeof (rfc_dataEntryGeneral_t) - 1 + rbuffl +
				2);
			// 2 extra bytes needed on top of two extra bytes
			// from mbs; at this stage rbuffl = max paylen + 2
#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
		if (db == NULL)
			syserror (EMALLOC, "cc13");
#endif
		db->status = DATA_ENTRY_PENDING;

