senserf/picos/PicOS/CC13XX/rfprop.c
		if (i)
			// Link to previous
			da->pNextEntry = (byte*) db;
		else
			re = db;

		db->config.type = 0;	// General (data in structure)
		db->config.lenSz = 1;	// Single byte for length
		db->config.irqIntv = 0;	// Irrelevant
		db->length = rbuffl + 2;
		if (++i == NRBUFFS)
			break;
		da = db;
	}

	// Link last to first
	db->pNextEntry = (byte*) re;

	// This is an alias for RF_cmdPropRx.pQueue
	rbuffs = (dataQueue_t*) umalloc (sizeof (dataQueue_t));
		
#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (rbuffs == NULL)
		syserror (EMALLOC, "cc13");
#endif
	rbuffs->pCurrEntry = (byte*) re;
	rbuffs->pLastEntry = NULL;

	// Prepare the command to start reading
	RF_cmdPropRx . pOutput = (byte*) &rxstat;

	// I guess this is how we make sure the command runs in a loop
	RF_cmdPropRx . pktConf . bRepeatOk = 1;
	RF_cmdPropRx . pktConf . bRepeatNok = 1;

	// Auto-discard rejects from the queue
	RF_cmdPropRx . rxConf . bAutoFlushIgnored = 1;
	RF_cmdPropRx . rxConf . bAutoFlushCrcErr = 1;

	// RSSI appended to the received packet; also, by default, the CRC
	// is discarded and a status byte is appended
	RF_cmdPropRx . rxConf . bAppendRssi = 1;

	// Make rbuffl exactly equal to max payload length
	rbuffl -= 2;
}

static int option (int opt, address val) {

	int ret = 0;

	switch (opt) {

		case PHYSOPT_STATUS:

			ret = 2 | ((dstate & DSTATE_RXON) != 0);
			goto RVal;

		case PHYSOPT_RXON:

			_BIS (dstate, DSTATE_RXON);
OREvnt:
			p_trigger (drvprcs, qevent);

		case PHYSOPT_TXON:
		case PHYSOPT_TXOFF:
		case PHYSOPT_TXHOLD:

			goto RRet;

		case PHYSOPT_RXOFF:

			_BIC (dstate, DSTATE_RXON);
			goto OREvnt;

		case PHYSOPT_SETSID:

			statid = (val == NULL) ? 0 : *val;
			goto RRet;

		case PHYSOPT_GETSID:

			ret = (int) statid;
			goto RVal;

		case PHYSOPT_GETMAXPL:

			ret = rbuffl + 2;
			goto RVal;

	    	case PHYSOPT_ERROR:

			if (val != NULL) {
				memcpy (val, &rxstat,
					sizeof (rfc_propRxOutput_t));
			} else {
				memset (&rxstat, 0, 
					sizeof (rfc_propRxOutput_t));
			}

			goto RRet;

		case PHYSOPT_CAV:

			if (val == NULL)
				// Random backoff
				gbackoff (RADIO_LBT_BACKOFF_EXP);
			else
				utimer_set (bckf_timer, *val);

			goto OREvnt;

		case PHYSOPT_GETPOWER:

#if RADIO_DEFAULT_POWER <= 7
			ret = txpower;
#else
			ret = RADIO_DEFAULT_POWER;
#endif
			goto RVal;

		case PHYSOPT_RESET:

#if RADIO_DEFAULT_POWER <= 7
			// Just the patable
			patable = (val == NULL) ? patable_def : val;
Reset_pwr:
			RF_cmdPropRadioDivSetup.txPower = patable [txpower];
#endif
			_BIS (dstate, DSTATE_IRST);
			goto OREvnt;

#if RADIO_DEFAULT_POWER <= 7 && (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS) == 0
		// Can be set
		case PHYSOPT_SETPOWER:

			// This goes via a global reset; apparently, we can do
			// per-packet power via a special command; the global
			// reset makes sense for a casual SETPOWER, because we
			// can execute it sensibly regardless of the RF state

			ret = txpower = (val == NULL) ? RADIO_DEFAULT_POWER :
				(*val > 7) ? 7 : *val;
			goto Reset_pwr;
#endif
		case PHYSOPT_GETCHANNEL:

			ret = (int) channel;
			goto RVal;

		case PHYSOPT_SETCHANNEL:

			channel = (val == NULL) ? RADIO_DEFAULT_CHANNEL :
				(*val > 7) ? 7 : *val;
			plugch ();
			_BIS (dstate, DSTATE_IRST);
			goto OREvnt;

		case PHYSOPT_GETRATE:

#if RADIO_BITRATE_INDEX > 0
			ret = (int) vrate;
#endif
			goto RVal;

#if RADIO_BITRATE_INDEX > 0

		case PHYSOPT_SETRATE:

			vrate = (val == NULL) ? RADIO_BITRATE_INDEX :
				(*val > 3) ? 3 : (*val < 1) ? 1 : *val;
			plugch ();
			_BIS (dstate, DSTATE_IRST);
			goto OREvnt;
#endif
		case PHYSOPT_SETPARAMS:

			// For now, this sets the off delay
			offdelay = (val == NULL) ? RADIO_DEFAULT_OFFDELAY :
				*val;
			goto RRet;

		default:

			syserror (EREQPAR, "cc13 op");
	}
RRet:
	return ret;
RVal:
	if (val != NULL)
		*val = ret;
	goto RRet;
}

// ============================================================================

void phys_cc1350 (int phy, int mbs) {
//
// For combatibility with cc1100, mbs does cover the checksum (or status
// bytes), so it is equal to max payload length + 2. Not sure what the maximum
// packet length is (and I have reasons not to trust the manual), so let me
// assume it is 255 - 4 - 1 = 250. We shall be careful.
//

#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (rbuffl != 0)
		/* We are allowed to do it only once */
		syserror (ETOOMANY, "cc13");
#endif
	if (mbs == 0)
		mbs = CC1350_MAXPLEN;

#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (mbs < 6 || mbs > CC1350_MAXPLEN)
		/* We are allowed to do it only once */
		syserror (EREQPAR, "cc13 mb");
#endif

	rbuffl = (byte) mbs;

	// Allocate the receive pool
	init_rbuffs ();

	physid = phy;

	// Register the phy
	qevent = tcvphy_reg (phy, option, INFO_PHYS_CC1350);

	LEDI (0, 0);
	LEDI (1, 0);
	LEDI (2, 0);

#if DIAG_MESSAGES
	diag ("CC1350: %d, %d, %d", RADIO_BITRATE_INDEX, RADIO_DEFAULT_POWER,
		RADIO_DEFAULT_CHANNEL);
#endif

	// Install the backoff timer
	utimer_add (&bckf_timer);

	// Start the driver process
	drvprcs = runthread (cc1350_driver);

#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (drvprcs == 0)
		syserror (ERESOURCE, "cc13");
#endif
	// Preset the power, rate, and channel

#if RADIO_DEFAULT_POWER <= 7
#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
	cmd_sp.txPower =
#endif
	RF_cmdPropRadioDivSetup.txPower =
		patable [txpower = RADIO_DEFAULT_POWER];
#endif

#if RADIO_BITRATE_INDEX > 0
	plugrt ();
#endif
	plugch ();

	// Make sure, prop mode is selected in PRCM (this is supposed to be
	// the default)
	HWREG (PRCM_BASE + PRCM_O_RFCMODESEL) =  RF_MODE_PROPRIETARY_SUB_1;

	// Precompute the Trim
	RFCRTrim ((rfc_radioOp_t*)&RF_cmdPropRadioDivSetup);
       	RFCRfTrimRead ((rfc_radioOp_t*)&RF_cmdPropRadioDivSetup,
			(rfTrim_t*)&rfTrim);

	// Direct all doorbell interrupts permanently to CPE0
	HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEISL) = 0;
}

//
// Notes:
//
//	CMD_PING can be a way to trigger an interrupt, especially that we put
//	them all into a single basket
//
//	Implement timeouts for commands that wait for interrupts; when the
//	receiver is on, recover every second or so (reimplement xmit using
//	interrupts and keep a special thread issuing periodic triggers or
//	something like that
